read_verilog my_opt_logic_demo.v
proc
opt_clean
stat
my_opt_expr
my_opt_cover
my_opt_qm
my_opt_kernel
my_opt_dce
opt_clean
stat
write_rtlil my_opt_logic_demo.il
