read_verilog my_opt_two_level_demo.v
proc
opt_clean
stat
my_opt_cover -max_vars 12 -max_iter 16
my_opt_qm -max_vars 8
my_opt_kernel
opt_clean
stat
write_rtlil my_opt_two_level_demo.il
