read_verilog my_opt_algebra_demo.v
prep -top top
copy top gold
copy top gate

select gate
my_opt_rewrite
my_opt_dce
opt_clean
select *

equiv_make gold gate equiv
prep -top equiv
equiv_simple
equiv_status -assert
