read_verilog my_opt_two_level_demo.v
prep -top top
copy top gold
copy top gate

select gate
my_opt_cover -max_vars 12 -max_iter 16
my_opt_qm -max_vars 8
my_opt_kernel
opt_clean
select *

equiv_make gold gate equiv
prep -top equiv
equiv_simple
equiv_status -assert
